app/controllers/articles_controller.rb

      def create
        @article = Article.new(@article_params)
        @article.save
---
INSERT INTO "articles" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-12-17 17:23:50.387890"], ["updated_at", "2020-12-17 17:23:50.387890"]]

      def edit
      article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]